[
    { "model": "contenttypes.contenttype", "pk": 7, "fields": { "app_label": "Blog", "model": "post" } },
    { "model": "contenttypes.contenttype", "pk": 9, "fields": { "app_label": "Blog", "model": "genre" } },
    { "model": "contenttypes.contenttype", "pk": 10, "fields": { "app_label": "Blog", "model": "author" } },
    { "model": "contenttypes.contenttype", "pk": 11, "fields": { "app_label": "Blog", "model": "language" } },
    { "model": "contenttypes.contenttype", "pk": 12, "fields": { "app_label": "Blog", "model": "book" } },
    { "model": "contenttypes.contenttype", "pk": 13, "fields": { "app_label": "Blog", "model": "writer" } },
    { "model": "contenttypes.contenttype", "pk": 15, "fields": { "app_label": "Blog", "model": "comment" } },

    { "model": "Blog.homepage", "pk": 1, "fields": { "image": "genre_pics/133f38fba29f320aa01c47b41687156c_t2FgpvA.jpg", "genre": [4] } },
    { "model": "Blog.homepage", "pk": 3, "fields": { "image": "genre_pics/romance_kIAaGGX.jpg", "genre": [3] } },
    { "model": "Blog.homepage", "pk": 5, "fields": { "image": "genre_pics/sci_fi_tfhB7LK.jpg", "genre": [2] } },
    { "model": "Blog.homepage", "pk": 6, "fields": { "image": "genre_pics/thriller.jpg", "genre": [5] } },
    { "model": "Blog.homepage", "pk": 7, "fields": { "image": "genre_pics/adventure_G1OHyug.jpg", "genre": [7] } },
    { "model": "Blog.homepage", "pk": 8, "fields": { "image": "genre_pics/horror_2j6iTVc.jpg", "genre": [12] } },
    { "model": "Blog.homepage", "pk": 9, "fields": { "image": "genre_pics/detective_WMdsGay.jpg", "genre": [10] } },
    { "model": "Blog.homepage", "pk": 10, "fields": { "image": "genre_pics/fantacy_xrDt7QC.jpg", "genre": [11] } },
    { "model": "Blog.homepage", "pk": 11, "fields": { "image": "genre_pics/hifi_QmOzi4x.jpg", "genre": [8] } },
    { "model": "Blog.homepage", "pk": 12, "fields": { "image": "genre_pics/historical_IaCYS2f.jpg", "genre": [9] } },
    { "model": "Blog.genre", "pk": 2, "fields": { "name": "Sci-Fi" } },
    { "model": "Blog.genre", "pk": 3, "fields": { "name": "Romance" } },
    { "model": "Blog.genre", "pk": 4, "fields": { "name": "Comedy" } },
    { "model": "Blog.genre", "pk": 5, "fields": { "name": "Thriller" } },
    { "model": "Blog.genre", "pk": 7, "fields": { "name": "Adventure" } },
    { "model": "Blog.genre", "pk": 8, "fields": { "name": "Historical Fiction" } },
    { "model": "Blog.genre", "pk": 9, "fields": { "name": "Mythology" } },
    { "model": "Blog.genre", "pk": 10, "fields": { "name": "Detective" } },
    { "model": "Blog.genre", "pk": 11, "fields": { "name": "Fantacy" } },
    { "model": "Blog.genre", "pk": 12, "fields": { "name": "Horror" } },
    { "model": "Blog.language", "pk": 1, "fields": { "name": "English" } },
    { "model": "Blog.language", "pk": 2, "fields": { "name": "Bengali" } },
    { "model": "Blog.book", "pk": 1, "fields": { "image": "book_pics/Cover_page_of__Chander_Pahar__a_novel_by_Bibhutibhusan_Banerjee.jpg", "title": "Chander Pahad", "publication": "M. C. Sircar & Sons Limited (1937)", "summary": "Shankar,a bengal boy,a brave and talented athlete , went to east Africa for his job of station master at Uganda railway station inspite of doing a normal job at his homeground after passing F.A examination.There in a strange situation he met portuguese adventurer Diago Alvarez, and after that his life changed forever.He went to the richtersveld mountain with Alvarez to find a unknown mine of diamond.But  there came the horrifying story of Bunip, the guardian  angel of that mine.Bunip was the saviour of nature from the deforestation caused by human.That mountain was called Oldnio Lengai,that means \"the mountain of the moon\".There Shankar faced the volcano and many other strange and unbelievable experiences.He struggled with death and lastly he returned home successfully with  a small piece of diamond.", "bookreview": "This is a classic book of bengal's young adult adventure fiction.The portrait of Africa is drawn very beautifully by the author. Also the geographical and natural description is perfect.Surprisingly the author had never visited Africa during  his lifespan, all were his imagination ! what a perfect descriptions of everything! This book is also shows the wanderlust of youths in bengal. This book is a must read for all. And if the reader is bengali then it is suggested that he or she should read the Bengali original edition to catch the perfect essence. The book is also available in English.", "buying_link": "https://www.amazon.in/s?k=9789350400401&i=stripbooks&linkCode=qs&tag=x_gr_w_bb_in-21&ref=x_gr_w_bb", "language": 2, "date_posted": "2019-06-29T14:40:30Z", "the_writer": [14], "the_genre": [7] } },
    { "model": "Blog.book", "pk": 2, "fields": { "image": "book_pics/lovecraft_9XBCyVc.jpg", "title": "Great Tales of Horror", "publication": "Fall River Press (1991)", "summary": "This volume collects twenty of Lovecraft's best-known horror stories, including several that laid the foundation for the Cthulhu Mythos, a pattern of myth and lore that represents the high point of his writing and once of the most original contributions to fantastic fiction of the past century.Selections include:\"Pickman's Model\" The monsters in Richard Upton Pickman's paintings were so hideously lifelike you might easily believe that they had been painted from real life.\"The Rats in the Walls\" The nightly scramblings of foraging rats in the walls were disturbing enough -- but what horror did their destination belowground suggest?\"The Call of Cthulhu\" An island risen from the depths of the Pacific Ocean houses a denizen whose emergence in our world portends the end of life as we know it.\"At the Mountains of Madness\" In the wastes of Antarctica, an exploration team discovers the remnants of an inconceivably ancient pre-human civilization that whatever wiped it out may still be at large.", "bookreview": "H.P. Lovecraft wrote horror stories like no other author before of after him. In the pages of Weird Tales and other pulp-fiction magazines of the 1920s and '30s, Lovecraft pioneered a new type of story that fused the thrills of supernatural horror with the visionary concepts of science fiction. His unique style of cosmic horror revolutionized the modern horror tale through its depiction of a vast universe indifferent to human existence and populated by incomprehensibly alien monsters.H.P. Lovecraft: Great Tales of Horror is your passport to unique worlds of wonder and terror as only one of the greatest horror writers of all time could imagine them.", "buying_link": "https://www.amazon.com/H-P-Lovecraft-Horror-Classics/dp/1435140370/ref=sr_1_1?keywords=great+tale+of+horror+hp+lovecraft&qid=1561824965&s=books&sr=1-1", "language": 1, "date_posted": "2019-06-29T16:07:58Z", "the_writer": [7], "the_genre": [12] } },
    { "model": "Blog.book", "pk": 3, "fields": { "image": "book_pics/dashu_dpasG5r.jpeg", "title": "Pagla Dashu", "publication": "Ananda Publishers", "summary": "Pagla Dashu is a character appearing in several prominent works of Bengali literature from the early 20th century, most notably Pagla Dashu (1940). He is a school boy, famous for his crazy ideas and often inexplicable acts like putting crackers under teacher's table,carrying a suspicious box,destroying a play act by speaking wrong dialogues and entering at wrong time that carry subtle, comedic satire. Pagla Dashu is a witty, intelligent yet naughty and meritorious kid, who keeps having fun in troubling people who rivaled or insulted him. He has a great sense of humor and can make out an issue in his school with the smallest of the things around. He is a very good student in academics and especially mathematics, yet he is famous for his craziness.", "bookreview": "Pagla Dashu has become one of the very popular characters of Bengali literature, like many other characters created by Sukumar Ray, a popular Bengali author of nonsense poetry. The writer, as a classmate of Dashu has narrated all the series of Pagla Dashu, which keeps child readers even more interested than to hear such humorous stories from a comparably senior writer. So Sukumar Ray himself took his character and mindset into a usual child and narrates the stories.  Dashu has stolen hearts of many witty and humorous readers because of the twists in his planned tricks to trouble some specific people or mate.", "buying_link": "https://www.amazon.in/Pagla-Dasu-Sakumar-Ray/dp/9350402858/ref=sr_1_1?keywords=pagla+dashu&qid=1561826362&s=books&sr=1-1", "language": 2, "date_posted": "2019-06-29T16:27:36Z", "the_writer": [15], "the_genre": [4] } },
    { "model": "Blog.book", "pk": 4, "fields": { "image": "book_pics/sh_GPETMqI.jpg", "title": "The Complete Sherlock Holmes (2 Volumes)", "publication": "Bantam Classics", "summary": "Volume 1 encompasses The Adventures, The Memoirs and the novels A Study in Scarlet and The Sign of Four,which introduced the eccentric genius of Sherlock Holmes to the world. This baffling murder mystery, with the cryptic word Rache written in blood, first brought Holmes together with Dr. John Watson. Next, The Sign of Four presents Holmes’s famous “seven percent solution” and the strange puzzle of Mary Morstan in the quintessential locked - room mystery. The Final Problem marks the death of Sherlock Holmes which the public vehemently protested so Doyle was forced to revive his sleuth and hence the second volume of the canon.Volume 2 contains the ever-popular The Hound of Baskervilles and the chilling novel A Valley of Fear. The short stories are divided into The Return, The Casebook and His Last Bow.", "bookreview": "The Sherlock Holmes stories were the source of modern crime-solving adaptations that we now experience in television, and Doyle's tales of mystery and adventure were often audacious, insightful and clever. The real draw of his stories is the process of crime detection (\"deductive reasoning\") that Doyle allows the readers to understand, experience and apply themselves alongside Watson as Holmes investigates the cases. It is worth noting that when Holmes returned from the grave, Doyle has completely added more ambiguous layers to his personality and characterization which is why the second volume is the most enjoyable for its gray shades of morality and scope of justice and punishment.", "buying_link": "https://www.amazon.in/Complete-Sherlock-Holmes-Volumes-1986-10-01/dp/B00BP0OFP0/ref=sr_1_1?keywords=bantam+classics+sherlock&qid=1561828097&s=books&sr=1-1", "language": 1, "date_posted": "2019-06-29T16:59:54Z", "the_writer": [8], "the_genre": [10] } },
    { "model": "Blog.book", "pk": 5, "fields": { "image": "book_pics/shanku_tgax9g4.jpg", "title": "Shanku Samagra", "publication": "Ananda Publishers", "summary": "Created by the literary genius Satyajit Ray, Professor Shonku is primarily an inventor rather than a scientist engaged in a specific field (much like Edison). He is quite a prodigy, having a double honours in Physics and Chemistry, and being able to fluently converse in 69 languages. Yet the man within is quite like any other middle class erudite Bengali. He lives with his 24 year old cat Newton, and a forgetful man-servant, Prahlad.With his inventions, he visits many science conferences around the world, or goes out for scientific expeditions, where he gets caught up in mysterious dealings and crimes. With the help of his wit and inventions, and sometimes with the help of his friends Somerset, Saunders and Kroll, he helps to establish the truth. the stories never tend to become preachy. On the contrary, the adventures, and the fast pace makes them complete page-turners.", "bookreview": "Each story is written in the form of a diary entry -- the format was such a novelty in Bengali literature at the time of it's publication, that it made the reader actually consider the possibility whether Shonku was indeed a living person. Primarily targeted for young adults, another great aspect of this series is that you can learn so much about the different cultures of the world, which can be really great for a teen, who seeks information along with the Science Fiction story line and thrill .The stories never tend to become preachy. On the contrary, the adventures, and the fast pace makes them complete page-turners.", "buying_link": "https://www.amazon.in/gp/product/8177562320/ref=x_gr_w_bb?ie=UTF8&tag=x_gr_w_bb_in-21&linkCode=as2&camp=3626&creative=24790", "language": 2, "date_posted": "2019-06-29T17:17:39Z", "the_writer": [5], "the_genre": [2, 7] } },
    { "model": "Blog.book", "pk": 6, "fields": { "image": "book_pics/ac_6lVJj8m.jpg", "title": "And Then There Were None", "publication": "Harper Collins", "summary": "Ten people receive a mystery letter from someone they don't know that indicates they should come to a remote island. Why would they go?After arriving, they try to figure out the connection between all of them while waiting for their mysterious host. After coming across a cute little poem about how ten little indians die, they decide they will wait it out until the next morning when the ferry comes back to take them home. But it will never come! Each guest suddenly dies matching the line from the poem... resulting in alliances and mistrust.", "bookreview": "It's written well with an accurate insight on human desperation & how psychosomatic effects can drastically warp one's sense of control. The length (only 264 pages) & pacing of this novel is very appropriate. It gives adequate page space to the mystery & the characters, acquainting the reader quickly with the situation so that we can dive straight into the action.If you are a mystery thriller fan, you must read this. If you've never read Agatha Christie, this must be your first - before you tackle Miss Marple or Hercule Poirot. You must understand the master before getting hooked on any specific protagonist in one of her other series.", "buying_link": "https://www.amazon.in/gp/product/0008123209/ref=ppx_yo_dt_b_bia_widget_title_o00_s00?ie=UTF8&psc=1", "language": 1, "date_posted": "2019-06-29T17:34:35Z", "the_writer": [9], "the_genre": [5] } },
    { "model": "Blog.book", "pk": 7, "fields": { "image": "book_pics/Shesher_Kabita_front_cover_otfVfLn.jpg", "title": "Sesher Kobita", "publication": "Visva-Bharati (1929)", "summary": "It’s a love story between Amit and Lavanya. The plot had been sketched in the beautiful hill station of Shillong. The protagonists met because of a small motor accident and soon they found an intense chemistry between them. They discovered philosophy through their poetry. ‘Sesher Kobita’ is a very modern story.", "bookreview": "The way the author described the emotions, feelings and love in the story is absolutely incredible. Sometime it's unbelievable how someone can sketch the protagonists so closely to life without being part of them. The imagination touches the highest level through his creation. His realization for the world and universe is beyond our imagination. The story ends but it’s really not, still feel the characters running around back of mind. Amazing realization indeed.If you are bengali then you should definitely read the bengali original version to get the essence of the poems that are used metaphorically in the novel.English version of the book is also available.", "buying_link": "https://www.amazon.in/Shesher-Kabita-Bengali-Rabindranath-Thakur/dp/8183742319?tag=googinhydr18418-21&tag=googinkenshoo-21&ascsubtag=_k_CjwKCAjwmNzoBRBOEiwAr2V27Xmep94_aQWQZ0AjxeRiLL_0jk227y8UnSk9d1fVnRlKcJVy3hGSyxoCEQ4QAvD_BwE_k_&gclid=CjwKCAjwmNzoBRBOEiwAr2V27Xmep94_aQWQZ0AjxeRiLL_0jk227y8UnSk9d1fVnRlKcJVy3hGSyxoCEQ4QAvD_BwE", "language": 2, "date_posted": "2019-06-29T20:39:49Z", "the_writer": [13], "the_genre": [3] } },
    { "model": "Blog.book", "pk": 8, "fields": { "image": "book_pics/happy_prince.jpg", "title": "The Happy Prince: And Other Tales", "publication": "Watchmaker Publishing", "summary": "The Happy Prince and Other Tales (also called \"The Happy Prince and Other Stories\") is a collection of stories for children by Oscar Wilde first published in May 1888. It contains five stories: \r\n1) The Happy Prince- a sparrow helps his friend who sees misery from where he stands help alleviate some grief, he witnesses.\r\n2) The Nightingale and the Rose- the nightingale gives everything for love. \r\n3) The Selfish Giant- a giant comes back home to see his garden invaded.\r\n4) The Devoted Friend- a Miller thinks his friendship is just wonderful. (This and the next story deal with self centeredness)\r\n5) The Remarkable Rocket- the rocket thinks he is just wonderful and looks down on everything else.", "bookreview": "This short collection has about 5 tales in it and each of them were delightful and with a moral to boot. What makes this anthology special is the fact that it is not in a preaching format but there is a slight tongue in cheek manner, which brought a delectable flavor; something that most moralistic tales don’t have these days, especially the adult ones. Each tale in this compilation was different but there was a strong lesson that could be seen in all. This was the lesson of love and friendship, how it differs in every scenario and what exactly is true love or devoted friendship. The lessons taught in these stories were of good and bad, bad might not be necessarily evil but more of the selfish kind, it talked of selflessness and how true love redeems everything in the end.", "buying_link": "https://www.amazon.in/Happy-Prince-Other-Tales/dp/1603864601/ref=sr_1_2?crid=2MVOMGJ0E6AOR&keywords=the+happy+prince+and+other+tales+by+oscar+wilde&qid=1561842061&s=books&sprefix=thehappy+prince%2Cstripbooks%2C371&sr=1-2", "language": 1, "date_posted": "2019-06-29T20:59:15Z", "the_writer": [12], "the_genre": [11] } },
    { "model": "Blog.book", "pk": 9, "fields": { "image": "book_pics/historical_5UmKk0L.jpg", "title": "Oitihasik Kahini Samagra", "publication": "Ananda Publishers", "summary": "this one contains 17 stories and 5 novels,( Kaler Mondira, Gourmollar, Tumi Sondhyar Megh, Kumarsombhober Kobi, Tungabhadrar Teerey ), each of opens a new-universe to the reader. From the ancient Dravidian tribes that may have roamed India before even recorded civilization, to Vedic Age, to Medieval and Invasion periods, these tales are enriched in the exquisite and stunning literature that one have ever come across. Apart from that, one also sees the presence of Buddhism and it's inner ideals in some of the writings.In the story of Rakta-Sandhya, we get to see a new and revolting side about Portuguese \"explorers\" like Vasco-da-Gama. There are stories from the Vindhya and Aravalli ranges. There are tales of the antiquity of Gauda (Bengal in the ancient times).", "bookreview": "The stories and novels are laced with renowned characters of history. But we see them through the eyes of the fictional characters that the author creates and gives life. love and legend to!The author sometimes let you look into the other side of the story that may have been happened under the lights of other important history.There are quite a few stories about re-incarnation. It's quite evident that the author have been quite into it.For all bengali readers are recommended the original bengali version which is more than beautiful. For other fictional fans, these tales are also a must! There are English-translations of these tales too (though not all) Try them out if you can!", "buying_link": "https://www.amazon.in/Oitihasik-Kahini-Samagra-Sharadindu-Bandyopadhyay/dp/8170669820", "language": 2, "date_posted": "2019-06-29T21:19:24Z", "the_writer": [10], "the_genre": [8] } },
    { "model": "Blog.book", "pk": 10, "fields": { "image": "book_pics/rusty_TGkP6zb.jpg", "title": "Death Under the Deodars", "publication": "Penguin Random House", "summary": "The book is the latest one from Mr. Bond and is a collection of 8 short stories. The characters remain the same in all the stories, with events evolving around them. Miss Ripley-Bean is the central character in the book. She is seventy plus and has many stories to share. She lives in a portion of the Royal Hotel in Mussorie, which belonged to her father, but later sold to the current owner, Nandu. Mr. Lobo, another permanent resident of the hotel, entertains the guests by playing tunes on the piano. All these characters, in addition to the author himself and a few others, appear in all the stories. When Miss Ripley-Bean witnesses a murder, she is sure the murderer has recognized her. In another tale, a dead body is found in a box bed in one of the rooms of the hotel and one time, a big black dog seems to follow Mr. Bond to a party only to vanish, never to be seen again. The Daryaganj serial killer checks into the Royal Hotel. Who among the occupants would be his next victim?", "bookreview": "The hills sure have a lot of mystery hidden in their shadows. While that is the kind of inspiration writers are looking for, it can sometimes also act as a convenient setting to inspire a murderer.I absolutely relish Mr. Bond's works and this one isn't an exception. There were a few stories that I thought could have been more twisted or tweaked up. Half of the stories were of the classic Ruskin Bond style but the others kind of lacked the stunning end that we are so used to. Nevertheless, I found it to be a mixed bag but the reader would definitely enjoy the few good stories that had all the necessary ingredients for the perfect mystery.More than the stories themselves, it is the writing style that I so admire. Ruskin Bond has the knack of smoothly taking the story forward and then suddenly arriving at a shocking end.", "buying_link": "https://www.amazon.com/Death-under-Deodars-Ruskin-Bond/dp/0143333674/ref=tmm_pap_swatch_0?_encoding=UTF8&qid=1561896778&sr=1-1", "language": 1, "date_posted": "2019-06-30T12:07:24Z", "the_writer": [6], "the_genre": [5, 7] } },
    { "model": "Blog.book", "pk": 11, "fields": { "image": "book_pics/hp_AURv9fL.jpg", "title": "Harry Potter: The Complete Collection", "publication": "Bloomsbury Press", "summary": "Complete Harry Potter Boxed Set = Harry Potter Boxset (Harry Potter #1-7), J.K. Rowling\r\nHarry Potter is a series of fantasy novels written by British author J. K. Rowling. The novels chronicle the life of a young wizard, Harry Potter, and his friends Hermione Granger and Ron Weasley, all of whom are students at Hogwarts School of Witchcraft and Wizardry. The main story arc concerns Harry's struggle against Lord Voldemort, a dark wizard who intends to become immortal, overthrow the wizard governing body known as the Ministry of Magic, and subjugate all wizards and muggles, a reference term that means non-magical people.", "bookreview": "J.K. Rowling created a whole new magical world, very detailed and ingenious, which kept going for seven books with the same quality.There are so many interesting characters beyond the main ones, who are brilliant.The plot is intelligent, but to my opinion more impressive were two features. J.K. Rowling uses symbols in order to picture many psychological aspects of human nature. Secondly,another element is that the writer has an incredible knowledge of the teen's nature . She represents accurately the development of the characters, their mood swings, how they grow-up and become almost adults, and all these feeling love, friendship, jealousy, the feeling of failure and abandonment, thoughts about right and wrong and all the contradictions that may arise even in the strongest friendship.J.K.Rowling reached the child's inner world without being didactic and on the same time she managed to show that there is always a light in every hardship.", "buying_link": "https://www.amazon.in/dp/1408856778/ref=cm_sw_r_other_apa_i_S0kgDb1XNZE0F", "language": 1, "date_posted": "2019-06-30T12:23:51Z", "the_writer": [11], "the_genre": [7, 11] } },
    { "model": "Blog.book", "pk": 12, "fields": { "image": "book_pics/ackroyd_6EbfBzA.jpg", "title": "The Murder of Roger Ackroyd (Poirot)", "publication": "Harper Collins", "summary": "In the village of King's Abbot, a widow's sudden suicide sparks rumors that she murdered her first husband, was being blackmailed, and was carrying on a secret affair with the wealthy Roger Ackroyd. The following evening, Ackroyd is murdered in his locked study--but not before receiving a letter identifying the widow's blackmailer. King's Abbot is crawling with suspects, including a nervous butler, Ackroyd's wayward stepson, and his sister-in-law, Mrs. Cecil Ackroyd, who has taken up residence in the victim's home. It's now up to the famous detective Hercule Poirot, who has retired to King's Abbot to garden, to solve the case of who killed Roger Ackroyd--a task in which he is aided by the village doctor and narrator, James Sheppard, and by Sheppard's ingenious sister, Caroline.", "bookreview": "The ending is what makes this a 5-star book. Let me assure you: you will not guess who the murderer is. Never ever ever. When the murderer is revealed, you will not believe. When the murderer goes on to explain his/her actions, you will continue to not believe it. Only by rereading certain important passages will you start to realize that the answer was in front of you all the time, and you couldn't see it. It's a testament to Christie's skill as a writer that this is accomplished.", "buying_link": "https://www.amazon.in/Murder-Roger-Ackroyd-Poirot/dp/0007527527/ref=sr_1_3?crid=11L4B1IMAHODH&keywords=murder+of+roger+ackroyd&qid=1561899663&s=books&sprefix=murder+of+%2Cstripbooks%2C397&sr=1-3", "language": 1, "date_posted": "2019-06-30T12:53:29Z", "the_writer": [9], "the_genre": [10] } },
    { "model": "Blog.book", "pk": 13, "fields": { "image": "book_pics/wc_ruAeivL.jpg", "title": "The White Company", "publication": "Vintage Classics", "summary": "‘The White Company’ is one of the best historical novels from Doyle set in the backdrop of medieval England, France and Spain during the fourteenth century. This exciting knight-in-armor story was the result of a meticulous and arduous research by Doyle on the time period of Edward III; about Hundred Years' War; the campaigns of Edward, the Black Prince and the Middle Ages in general. Fueled by their appetite for glory, this motley crew of freebooters stands united in their unswerving devotion to the company commander, Sir Nigel Loring. Short, bald, and extremely nearsighted, Sir Nigel's unprepossessing appearance belies his warrior's heart and his chivalrous nature. The rollicking adventures of his company during the Hundred Years War center around Sir Nigel's loyal squire, Alleyne Edricson. Raised in the sheltered confines of a monastery, young Alleyne comes of age amid the rough-and-tumble of armed conflict and the bewildering ways of courtly love.", "bookreview": "Best known as the creator of Sherlock Holmes, Sir Arthur Conan Doyle was also a passionate historian. The White Company was his favorite among his own works; here, he offers flavorful, realistic depictions of life during the 14th century — from its weapons and apparel to its religious practice, and the close connection between the cycles of human existence, and the rhythm of the seasons. Readers of all ages will thrill to this spirited tale and its evocative portrait of the Middle Ages. ‘The White Company’ is strongly recommend for those who love invigorating tales of good-old-style adventure and chivalry.", "buying_link": "https://www.amazon.in/White-Company-Vintage-Classics/dp/1784870161/ref=sr_1_1?keywords=the+white+company&qid=1561901887&s=books&sr=1-1", "language": 1, "date_posted": "2019-06-30T13:34:20Z", "the_writer": [8], "the_genre": [8] } },
    { "model": "Blog.book", "pk": 14, "fields": { "image": "book_pics/doyle_9ceAzNZ.jpg", "title": "Best Horror Stories of Arthur Conan Doyle", "publication": "Chicago Review Press", "summary": "These horror stories  are carefully crafted, compelling and believable. Written in about the same decade as the Sherlock Holmes series, they will convince you that Arthur Conan Doyle was a master of more than just the detective story.This collection of some of his short horror stories is as brilliant as it is varied. From mummies, to funnels to stripes and to a terrifying flight in up into the heights, his brilliant style leaves the reader begging for more.Each story in this collection is unique and the terror that we are introduced is different from the previous one.", "bookreview": "Known best for his beloved Sherlock Holmes, Sir Arthur Conan Doyle was extremely gifted in his other writings as well.  His skill in bringing suspense and horror is as exciting and surprising as his stories with Holmes. Of this collection the two that stand out to me are the \"Horror in the Heights\" which has an almost Lovecraftian feel, and \"The Striped Chest\" which is a brilliant locked-door horror/mystery. I strongly recommend this collection to any fan of Mr. Doyle.", "buying_link": "https://www.amazon.in/gp/product/0897332652/ref=x_gr_w_bb?ie=UTF8&tag=x_gr_w_bb_in-21&linkCode=as2&camp=3626&creative=24790", "language": 1, "date_posted": "2019-06-30T13:50:10Z", "the_writer": [8], "the_genre": [12] } },
    { "model": "Blog.book", "pk": 15, "fields": { "image": "book_pics/owc_6UVI7Qv.jpg", "title": "The Importance of Being Earnest", "publication": "Prestwick House Inc. (1895)", "summary": "The Importance of Being Earnest is the most renowned of Oscar Wilde’s comedies. It’s the story of two bachelors, John ‘Jack’ Worthing and Algernon ‘Algy’ Moncrieff, who create alter egos named Ernest to escape their tiresome lives. They attempt to win the hearts of two women who, conveniently, claim to only love men called Ernest. The pair struggle to keep up with their own stories and become tangled in a tale of deception, disguise and misadventure. The elaborate plot ridicules Victorian sensibilities with some of the best loved, and indeed bizarre, characters to be found on the modern stage.It has three acts.", "bookreview": "Wilde certainly has a way with words. I love the complexity and multi layered plot for this. Everything from the title is a play on words, satirical and funny. Although it's relatively short, it's well developed and the characters are fully formed and fleshed out well. Algernon is a firm favourite. He seems to get all the best lines, and his wit is as sharp as a sword. His decision to turn up at Jack's country house as his brother Ernest is this driving force behind the conclusion of the play too. Delightful.", "buying_link": "https://www.amazon.in/gp/product/158049580X/ref=x_gr_w_bb?ie=UTF8&tag=x_gr_w_bb_in-21&linkCode=as2&camp=3626&creative=24790", "language": 1, "date_posted": "2019-06-30T14:22:22Z", "the_writer": [12], "the_genre": [3, 4] } },
    { "model": "Blog.book", "pk": 16, "fields": { "image": "book_pics/romancerusty_cwSKAj6.jpg", "title": "Falling in Love Again: Stories of Love and Romance", "publication": "Rupa Publications India", "summary": "19 stories and poems of Ruskin Bond that will take reader to the world of love and romance. These stories capture beautiful moments of life, interspersed with fleeting emotions.The book also has Susanna's Seven Husbands, made into a Hindi movie by Vishal Bharadwaj whom Ruskin dedicates this book, along with Bhardwaj's wife, Rekha. There are couple of book extracts - The Room on the Roof and Delhi is not far from his earlier books.", "bookreview": "'Falling In Love Again' justifies the existence of a phenomenal author like Ruskin Bond. This book touched me by the soul. This is one of the books which inspires you into deep thinking,evaluation and analysis of things you never imagined of. For all lovers, who are waiting to be engrossed and amazed by an incredible charmer, Your wait has ended.The slight not commonly seen side of Ruskin Bond is highlighted in this spectacular sculpture of infatuation and love.This book goes into the depth for the need of the most meaningful component of life-love in each individual. While reading this book ,I got so enthralled by the importance of love in every individual's life towards another, that I wanted to stop time and enjoy these treasured stories wholeheartedly forever and ever and ever.", "buying_link": "https://www.amazon.in/Falling-Love-Again-Stories-Romance/dp/8129120437/ref=sr_1_1?keywords=9788129120434&linkCode=qs&qid=1561905786&s=books&sr=1-1", "language": 1, "date_posted": "2019-06-30T14:38:51Z", "the_writer": [6], "the_genre": [3] } },
    { "model": "Blog.book", "pk": 17, "fields": { "image": "book_pics/challenger_Z6pGVDH.jpg", "title": "The Complete Professor Challenger", "publication": "PROJAPOTI", "summary": "Professor George Edward Challenger is the most famous character created by Arthur Conan Doyle. The first novel in this series is The Lost World. The Readers will follow the brilliant Professor Challenger as he and his bold and fearless companions, Edward Malone, Lord John Roxton and Professor Summerlee travel up the Amazon River to a remote plateau, cut off from the rest of the world, where creatures from prehistoric times still walk among more modern beasts. A deadly, dangerous and unexplored land filled with exciting discoveries. The explorers were to confront all manner of atavisms: dinosaurs, bizarre beasts, and ferocious ape-men.  This collection contains all novels and stories featuring the famous character, Professor George Edward Challenger. 'THE LOST WORLD', 'THE POISON BELT',  'THE LAND OF MIST', 'WHEN THE WORLD SCREAMED', 'THE DISINTEGRATION MACHINE'.", "bookreview": "Once you get into it, it's hard to put down! Slow to get started, but the second half of the book is fantastic for those readers who love a good \"lost world\" story, well told and with plenty of exciting action and detail, this book is a must. One terrific scene follows another, and the principal characters, especially the incomparable Professor Challenger, are well drawn. Here you can see Sir ACD giving his extra-ordinary art of story telling in the shape of Professor Challenger. Not only the stories had elements of pure genius, more than a century back but also had pure fictional magic. Beautiful language and strong connection to the well defined characters make the stories unputtable!", "buying_link": "https://www.amazon.in/COMPLETE-PROFESSOR-CHALLENGER-ARTHUR-CONAN/dp/8176062200?tag=googinhydr18418-21&tag=googinkenshoo-21&ascsubtag=_k_Cj0KCQjwu-HoBRD5ARIsAPIPenf_79eZL0ZTMHGPU0lM2Rv7t3u2BthwzL4Qa22k0F6Oi_96V4xB1PkaAo6uEALw_wcB_k_&gclid=Cj0KCQjwu-HoBRD5ARIsAPIPenf_79eZL0ZTMHGPU0lM2Rv7t3u2BthwzL4Qa22k0F6Oi_96V4xB1PkaAo6uEALw_wcB", "language": 1, "date_posted": "2019-06-30T14:53:30Z", "the_writer": [8], "the_genre": [2, 7] } },
    { "model": "Blog.book", "pk": 18, "fields": { "image": "book_pics/horror_rusty.jpg", "title": "A Season of Ghosts", "publication": "Penguin Random House India", "summary": "The stories in this collection are set amidst the mists and mellow magic of Bond's beloved mountains. The agents of the supernatural may be gentle like the fairy folk in 'On Fairy Hill', or malevolent like the well-dressed diners of 'The Prize'; humorous like the very proper witch, Miss Bellows, in 'The Black Cat', or tragic like the haunting Gulabi in 'Wilson's Bridge'. 'The Rakshasas' harks back to traditional hill spirits, while 'The Night of the Millennium' poises us tantalizingly on the brink of the future. Bond aficionados will meet familiar faces in 'Reunion at the Regal'. Rounding off this collection is a gripping mystery, 'Who Killed the Rani?', which is evocative of life in hill stations some twenty years ago. And over all the stories looms the benevolent or brooding presence of the Himalayas, described with Bond's inimitable lyricism.", "bookreview": "It is said that if the smell of the Himalayas creeps into a man's blood, he will return to the hills again and again, and will strive to live amongst them always. Ruskin Bond, master storyteller and connoisseur of the mysterious and macabre, shows how this love may persist to death and beyond.As far as the book goes, the stories are short, and refreshing. These are absolute bedtime grandma stories, and are not on the scary side. Bond's relationship with ghosts/spirits/paranormal is a curious feeling, and it doesn't create any fear, but leaves a warm snug after effect.", "buying_link": "https://www.amazon.in/Season-Ghosts-Ruskin-Bond/dp/0140287841", "language": 1, "date_posted": "2019-06-30T15:09:03Z", "the_writer": [6], "the_genre": [12] } },
    { "model": "Blog.book", "pk": 19, "fields": { "image": "book_pics/byomkesh_CsnEeDj.jpg", "title": "Byomkesh Samagra", "publication": "Ananda Publishers", "summary": "Byomkesh Bakshi is a fictional detective in Bengali literature created by Sharadindu Bandyopadhyay. He is one of the most famous detective characters in Bengali literature. This book contains all of his stories in one volume, including one incomplete story. Starting from Satyanweshi(Finder of Truth) to the unfinished one Bishupal Badh(Killing of Bishupal) , each and every baffling and puzzling mystery is solved by Byomkesh Bakshi using sound analytical skills and every event is chronicled by his friend Ajit Banerjee.", "bookreview": "Byomkesh bakshi appears to be a next door guy. The time-period in which the plots are set is also different. Sharadindu Bandyopadhyay, the author is heavily influenced by Sherlock Holmes and followed the same second person narrative, Ajith in place of Dr. Watson..He has finely depicted the socio-economic conditions of Bengal during Post World-War II and during partition of Bengal.I simply love it. You can't put the book down if you start reading it and believe me...even if you have read it once.Every time you read it.You’ll have something to cherish upon. I highly recommend Byomkesh for mature readers.", "buying_link": "https://www.amazon.in/gp/product/8172153554/ref=x_gr_w_bb?ie=UTF8&tag=x_gr_w_bb_in-21&linkCode=as2&camp=3626&creative=24790", "language": 2, "date_posted": "2019-06-30T15:20:29Z", "the_writer": [10], "the_genre": [10] } },
    { "model": "Blog.book", "pk": 20, "fields": { "image": "book_pics/feluda_SJliHPF.jpg", "title": "Feluda Samagra", "publication": "Ananda Publishers", "summary": "Between 1965 and 1992, Satyajit Ray wrote a total of 35 Feluda stories, featuring the master sleuth Pradosh C. Mitter, AKA Feluda. The plots involve murder, mystery and adventure, most of the times in exotic locations, narrated in a racy, humorous style by the detective's cousin-cum-assistant Topesh ranjan Mitter AKA Topshe, and in most cases, accompanied by the funny Lalmohan Ganguly AKA Jatayu, who himself was a famous crime writer. All of this makes for enormously entertaining fare - and it is no wonder that each Feluda book has been a best-seller. All the stories are now available together in this two volume omnibus. For the first time ever, the stories are arranged in chronological order of composition, and one can note Feluda's development from an unknown amateur detective to a famous investigator.", "bookreview": "The stories were originally written for children, but they are far more than children's stories. They are a chronicle of life in the 60s and 70s. The cases take Feluda and his friends all over India. Ray has a way with words when it comes to describing a place or an event.The plots were simple but not boring. It is in the plots that a strong influence of Doyle is seen. Things like buried treasures and family squabbles over inheritance were imported straight from England to India, but they were not damaged in transit. Ray managed to make these stories intensely Indian.The narrator is Topshe, or Tapesh ranjan, Feluda's cousin. He is younger than Feluda and chronicles all of Feluda's cases in detail. The device works very well.Prefer the Bengali version if you can.English is also available.", "buying_link": "https://www.amazon.in/Feluda-Samagra-Vol-I-II/dp/8177564803", "language": 2, "date_posted": "2019-06-30T15:25:04Z", "the_writer": [5], "the_genre": [7, 10] } },
    { "model": "Blog.book", "pk": 21, "fields": { "image": "book_pics/jaya_uXVHoGm.jpg", "title": "Jaya: An Illustrated Retelling of the Mahabharata", "publication": "Penguin India", "summary": "High above the sky stands Swarga, paradise, abode of the gods. Still above is Vaikuntha, heaven, abode of God.The doorkeepers of Vaikuntha are the twins, Jaya and Vijaya, both whose names mean 'victory'. One keeps you in Swarga; the other raises you into Vaikuntha.In Vaikuntha there is bliss forever, in Swarga there is pleasure for only as long as you deserve. What is the difference between Jaya and Vijaya? Solve this puzzle and you will solve the mystery of the Mahabharata.", "bookreview": "In this enthralling retelling of India's greatest epic, the Mahabharata originally known as Jaya, Devdutt Pattanaik seamlessly weaves into a single narrative plots from the Sanskrit classic as well as its many folk and regional variants, including the Pandavani of Chhattisgarh, Gondhal of Maharashtra, Terukkuttu of Tamil Nadu and Yakshagana of Karnataka.Richly illustrated with over 250 line drawings by the author, the 108 chapters abound with little-known details such as the names of the hundred Kauravas, the worship of Draupadi as a goddess in Tamil Nadu, the stories of Astika, Madhavi, Jaimini, Aravan and Barbareek, the Mahabharata version of the Shakuntalam and the Ramayana, and the dating of the war based on astronomical data.With clarity and simplicity, the tales in this elegant volume reveal the eternal relevance of the Mahabharata, the complex and disturbing meditation on the human condition that has shaped Indian thought for over 3000 years.", "buying_link": "https://www.amazon.in/gp/product/014310425X/ref=x_gr_w_bb?ie=UTF8&tag=x_gr_w_bb_in-21&linkCode=as2&camp=3626&creative=24790", "language": 1, "date_posted": "2019-06-30T16:05:45Z", "the_writer": [16], "the_genre": [9] } },
    { "model": "Blog.book", "pk": 22, "fields": { "image": "book_pics/ng_myth.jpg", "title": "Norse Mythology", "publication": "W. W. Norton & Company (2018)", "summary": "Neil Gaiman, long inspired by ancient mythology in creating the fantastical realms of his fiction, presents a bravura rendition of the Norse gods and their world from their origin though their upheaval in Ragnarok. \r\nIn Norse Mythology, Gaiman stays true to the myths in envisioning the major Norse pantheon: Odin, the highest of the high, wise, daring, and cunning; Thor, Odin’s son, incredibly strong yet not the wisest of gods; and Loki—son of a giant—blood brother to Odin and a trickster and unsurpassable manipulator.\r\nNorse Mythology is told in short stories. Some of the chapters are very short - only a page or two long - and others are slightly longer.", "bookreview": "Gaiman fashions these primeval stories into a novelistic arc that begins with the genesis of the legendary nine worlds and delves into the exploits of deities, dwarfs, and giants. Through Gaiman’s deft and witty prose, these gods emerge with their fiercely competitive natures, their susceptibility to being duped and to duping others, and their tendency to let passion ignite their actions, making these long-ago myths breathe pungent life again.", "buying_link": "https://www.amazon.com/gp/product/0393356183/ref=x_gr_w_bb?ie=UTF8&tag=x_gr_w_bb-20&linkCode=as2&camp=1789&creative=9325&creativeASIN=0393356183&SubscriptionId=1MGPYB6YW3HWK55XCGG2", "language": 1, "date_posted": "2019-06-30T16:27:12Z", "the_writer": [17], "the_genre": [9] } },
    { "model": "Blog.writer", "pk": 5, "fields": { "name": "Satyajit Ray", "penname": "oftenly called as Manik", "image": "writer_pics/satyajitray_qLh1ONa.jpg", "date_of_birth": "1921-05-02", "date_of_death": "1992-04-23", "Bio": "Satyajit Ray was an Indian filmmaker, movie-director, music composer, writer, publisher, painter, and lyricist. Satyajit Ray has international fame and recognition. He is the son of Sukumar Ray and grandson of Upendrakishore Ray Chowdhury. Both his father and grand-father were famous literary personalities.Ray was a student of Presidency College, Kolkata. He got lessons of art at Vishwa Bharati University at Santiniketan. His mother was a great admirer of Rabindra Nath Tagore.Ray directed several movies such as ‘Pather Panchali’ and ‘Charulata’, etc. for which he got both national and international acclamation. He had good knowledge of western art as well. He wrote many short-stories for young children.Pather Panchali, the first movie of Ray, that released in 1955, won several international awards.  Feluda, the famous fictional private detective, appeared in a series of novels and stories written by Ray. The character of the fictional scientist, Professor Shonku, is equally popular among children and adults.Satyajit Ray was honored with several prestigious awards, including Indian National awards, for the excellent art rendered through his films. He was awarded ‘honorary Oscar’ in 1992. He also honored with ‘Bharat Ratna’ in the same year.", "knowmore": "https://en.wikipedia.org/wiki/Satyajit_Ray" } },
    { "model": "Blog.writer", "pk": 6, "fields": { "name": "Ruskin Bond", "penname": "Rusty", "image": "writer_pics/rusty_rMaN70R.jpg", "date_of_birth": "1934-05-19", "date_of_death": null, "Bio": "In the course of a writing career spanning thirty five years, he has written over a hundred short stories, essays, novels and more than thirty books for children. Three collections of short stories, The Night Train at Deoli, Time Stops at Shamli and Our Trees Still Grow in Dehra have been published by Penguin India. He has also edited two anthologies, The Penguin Book of Indian Ghost Stories and The Penguin Book of Indian Railway Stories. Bonds writing is greatly influenced by the hills, and the valley of Dehra Dun, where he spent his childhood.   Ruskin Bond's first novel, The Room on the Roof, written when he was seventeen, won the John Llewellyn Rhys Memorial Prize in 1957. Vagrants in the Valley was also written in his teens and picks up from where The Room leaves off. These two novellas were published in one volume in 1993. His non-fiction writing, Rain in the Mountains was also much acclaimed. Since then he has written several novellas (including Vagrants in the Valley, A Flight of Pigeons and Delhi Is Not Far), essays, poems and children's books.Ruskin Bond has also written over 500 short stories and articles that have appeared in a number of magazines and anthologies. His novel, The Flight of Pigeons was adapted into a movie, Junoon.   He received the Sahitya Akademi Award in 1992 for Our Trees Still Grow in Dehra and the Padma Shri in 1999 for children\"s literature.", "knowmore": "https://en.wikipedia.org/wiki/Ruskin_Bond" } },
    { "model": "Blog.writer", "pk": 7, "fields": { "name": "H. P. Lovecraft", "penname": "Lewis Theobald, Humphrey Littlewit ,Ward Phillips, Edward Softly ,Percy Simple", "image": "writer_pics/lovecraft_rVuAMU9.jpg", "date_of_birth": "1890-08-20", "date_of_death": "1937-03-15", "Bio": "Lovecraft was editor,novelist,poet and short story writer. Weird fiction, horror fiction, science fiction, gothic fiction, fantasy fiction, cosmic horror etc were his favourite genre.Mostly an autodidact, he never finished school, staying at home due to fragile health, gobbling up books far advanced for his age. Writing his first story at the age of six, he took up writing as his profession at the age of twenty-four. Too shy to promote himself, he got little remuneration for his talent and most of his works were published in pulp magazines. All his life, he lived in poverty, often being forced to take up ghost-writing to meet his expenses, yet going hungry, eating bread that had gone past its expiry date. It was only after his death that two of his friends, August Derleth and Donald Wandrei, collected his stories and made arrangement for their publications. But for them, the world could have lost great pieces of treasure that has now created its own place in the canon of world literature. Lovecraft’s writings have had a great impact on modern popular cultures and have also influenced and inspired many of his contemporaries, such as August Derleth, Robert E. Howard, Robert Bloch, Fritz Leiber, Clive Barker, Stephen King, Alan Moore, Neil Gaiman and Mike Mignola. His most important literary movement were Cosmicism.He was married to Sonia Greene (m. 1924) ,a fiction writer and business woman.", "knowmore": "https://en.wikipedia.org/wiki/H._P._Lovecraft" } },
    { "model": "Blog.writer", "pk": 8, "fields": { "name": "Arthur Conan Doyle", "penname": "None", "image": "writer_pics/conan_dZApkjp.jpg", "date_of_birth": "1859-05-22", "date_of_death": "1930-07-07", "Bio": "Doyle's family (Conan was his middle name, and it was only later in life that he began to use it as his surname) sent him to Jesuit boarding schools to be educated, and he later entered the University of Edinburgh Medical School in 1881.While in school, Conan Doyle began writing to earn a little extra money. His first story, The Mystery of the Sasassa Valley was published in the Chambers' Journal in 1879.His third attempt at a novel was A Study in Scarlet, the story which introduced Sherlock Holmes to the world. Study was published in Mrs. Beeton's Christmas annual, in 1887. Encouraged by publishers to keep writing, Conan Doyle wrote his second Holmes mystery, The Sign of the Four, in 1890. The first Sherlock Holmes short story, A Scandal in Bohemia, appeared in The Strand Magazine in 1891, to be followed by two dozen more stories over the next several years.Conan Doyle served as a doctor in the Boer War, and on his return he wrote two books defending England's participation in that conflict. It was for these books that he received his knighthood in 1902.", "knowmore": "https://en.wikipedia.org/wiki/Arthur_Conan_Doyle" } },
    { "model": "Blog.writer", "pk": 9, "fields": { "name": "Agatha Christie", "penname": "Mary Westmacott", "image": "writer_pics/agatha_6tecBnZ.jpg", "date_of_birth": "1890-09-15", "date_of_death": "1976-01-12", "Bio": "Agatha Christie was an English writer of crime and romantic novels.She is best remembered for her detective stories including the two diverse characters of Miss Marple and Hercule Poirot.She is considered to be the best selling writer of all time.Only the Bible is known to have outstripped her collected sales of roughly four billion worldwide copies. Her works have been translated into more languages than any other individual writer.In the First World war, she trained and worked as a nurse helping to treat wounded soldiers.She also became educated in the field of pharmacy. Agatha Christie began writing in 1920, after the end of the First World War. Her first story was The Mysterious Affair at Styles, (1920). This featured the soon to be famous detective Hercule Poirot, who at the time was portrayed as a Belgian refugee from the Great War.   Agatha Christie went on to write over 40 novels featuring the proud and immaculate Hercule Poirot. She preferred her other great detective the quiet but effective old lady Miss Marple. In 1952, her play The Mousetrap was debuted at the Ambassador’s Theatre in London and has been performed without a break ever since.Her success led to her being honoured in the New Year’s honour list. In 1971 she was appointed Dame Commander of the British Empire.", "knowmore": "https://en.wikipedia.org/wiki/Agatha_Christie" } },
    { "model": "Blog.writer", "pk": 10, "fields": { "name": "Sharadindu Bandyopadhyay", "penname": "Chandrahaash", "image": "writer_pics/sharadindu_JY7X5kx.jpg", "date_of_birth": "1899-03-30", "date_of_death": "1970-09-22", "Bio": "Sharadindu Bandyopadhyay's repertoire was varied. He was equally at ease with short and long stories. He is primarily known as the creator of Byomkesh Bakshi, the quintessential Bengali detective, whose exploits touched the hearts of not just Bengali readers, but through translations, TV and cinema, of people across India and beyond.  The literary brilliance of his historical fiction remains unparalleled. Set in different periods of Indian history, right from the Pre-Aryan days to the Gupta, Mauryan era till the age of the Mughals — they are a unique blend of scintillating twists and turns, of romance, adventure, characterizations brough and vocabulary to suit the ethos of that bygone era to life by a unique idiom.About his writings in this genre – Saradindu himself had emphasised – ‘my stories are not fictionalised history, they are historical fiction.’ Sharadindu's books continue to be among the bestsellers in Bengali literature, primarily because of the unabated popularity of his detective Byomkesh. Satyajit Ray had filmed the story “Chiriakhana” with the superstar Uttam Kumar playing the lead.", "knowmore": "https://en.wikipedia.org/wiki/Sharadindu_Bandyopadhyay" } },
    { "model": "Blog.writer", "pk": 11, "fields": { "name": "J. K. Rowling", "penname": "Robert Galbraith", "image": "writer_pics/jk_htl6eAR.jpg", "date_of_birth": "1965-07-31", "date_of_death": null, "Bio": "J.K. Rowling ,British author, creator of the popular and critically acclaimed Harry Potter series.The first book in the Harry Potter series, Harry Potter and the Philosopher’s Stone (1997; also published as Harry Potter and the Sorcerer’s Stone)received numerous awards, including the British Book Award. Succeeding volumes—Harry Potter and the Chamber of Secrets (1998), Harry Potter and the Prisoner of Azkaban (1999), Harry Potter and the Goblet of Fire (2000), Harry Potter and the Order of the Phoenix (2003), and Harry Potter and the Half-Blood Prince (2005)—also were best sellers, available in more than 200 countries and some 60 languages. The seventh and final novel in the series, Harry Potter and the Deathly Hallows, was released in 2007.Film versions of the books were released in 2001–11 and became some of the top-grossing movies in the world. In addition, Rowling wrote the companion volumes Fantastic Beasts & Where to Find Them (2001), Quidditch Through the Ages (2001); and The Tales of Beedle the Bard (2008). Rowling made her first foray into adult fiction with The Casual Vacancy (2012; TV miniseries 2015).In 2013 the crime novel The Cuckoo’s Calling and the Silkworm—the second book in the series released in 2014. Later entries in the series included Career of Evil (2015) and Lethal White (2018). Rowling was appointed Officer of the Order of the British Empire (OBE) in 2001. In 2009 she was named a chevalier of the French Legion of Honour.", "knowmore": "https://en.wikipedia.org/wiki/J._K._Rowling" } },
    { "model": "Blog.writer", "pk": 12, "fields": { "name": "Oscar Wilde", "penname": "Sebastian Melmoth", "image": "writer_pics/oscar_QWovplw.jpg", "date_of_birth": "1854-10-16", "date_of_death": "1900-11-30", "Bio": "Oscar Wilde is one of the most iconic figures from late Victorian society. Enjoying a meteoric rise to the top of society, his wit, humour and intelligence shine through his plays and writings. However, due to his sexuality, he suffered the indignity and shame of imprisonment. For a long time, his name was synonymous with scandal and intrigue. However, with changing social attitudes, he is remembered with greater affection for his biting social criticism, wit and linguistic skills.His fame as a dramatist began with the production of Lady Windermere's Fan in February 1892. His next comedy was A Woman Of No Importance, produced on 19th April 1893 at the Haymarket Theatre in London by Herbert Beerbohm Tree. It repeated the success of Lady Windermere's Fan, consolidating Wilde's reputation as the best writer of \"comedy-of-manners\" since Richard Brinsley Sheridan.  A slightly more serious note was struck with An Ideal Husband, produced by Lewis Waller at the Haymarket Theatre on 3 January 1895. This contains a political melodrama—as opposed to the marital melodrama of the earlier comedies—running alongside the usual Wildean Epigrams, social commentary, comedy, and romance.Barely a month later, his masterpiece The Importance Of Being Earnest appeared at the St James's Theatre. It caused a sensation.", "knowmore": "https://en.wikipedia.org/wiki/Oscar_Wilde" } },
    { "model": "Blog.writer", "pk": 13, "fields": { "name": "Rabindranath Tagore", "penname": "Akapat Chandrabhaskar, Diksunya Bhattacharya, Nabinkishor Sharman, Shasthicharan Debsharma, Banibinod Vidyabinod, Srimati Kanistha, Srimati Madhyama, Annakali Pakrashi, Bhanusingha Thakur", "image": "writer_pics/robi_Cfa4F8s.jpg", "date_of_birth": "1861-05-07", "date_of_death": "1941-08-07", "Bio": "Poet, writer and humanitarian, Rabindranath Tagore was the first Indian to be awarded the Nobel Prize for Literature and he played a key role in the renaissance of modern India. Tagore is most widely known for his poetry, but he was also an accomplished author of novels, short stories, plays and articles. He took an active interest in a widespread range of social, cultural and artistic endeavours. He has been described as one of the first Twentieth Century’s global man.His father Debendranath Tagore was a leading light in the Brahmo Samaj – a reforming Hindu organisation which sought to promote a monotheistic interpretation of the Upanishads and move away from the rigidity of Hindu Orthodoxy which they felt was holding back India. Rabindranath began writing from an early age and impressed with his free-flowing style and spontaneous compositions. He mostly rejected formal schooling; he spent much time being taught at home. After returning to India, in 1901, Tagore moved to Shantiniketan to found an ashram which became his focal point for writing and his view on schooling. He chose the name for the ashram – Shantiniketan meaning ‘Abode of Peace’.In 1913, Tagore was awarded the Nobel Prize for literature for his work ‘Gitanjali‘ This made his writings internationally known and his fame spread throughout the world. This gave Tagore the opportunity to travel extensively giving lectures and recitals in many different countries.Tagore had a great love for nature and many of his poems invoke the simple beauties of the natural world. For Tagore, his religion could be found in the wonders and mysteries of nature – as much as in temples and sacred books.Tagore is unique for being the official composer for the national anthem of two countries – India’s Jana Gana Mana and Bangladesh’s Amar Shonar Bangla.In 1919, Tagore returned his knighthood in protest at the Jallianwala Bagh Massacre, in which many peaceful Indian protesters were killed.", "knowmore": "https://en.wikipedia.org/wiki/Rabindranath_Tagore" } },
    { "model": "Blog.writer", "pk": 14, "fields": { "name": "Bibhutibhushan Bandyopadhyay", "penname": "Kbachit Praurha", "image": "writer_pics/Bibhutibhushan_Bandopadhyay_hDkfzUp.jpg", "date_of_birth": "1894-09-12", "date_of_death": "1950-11-01", "Bio": "Bibhutibhushan Bandyopadhyay,this solitude-loving novelist portrayed the face of rural Bengal where nature and human life exist in close harmony. Creepers, grass, insects and spiders, all have a place in his descriptions of nature. His novels show his deep understanding of life and nature. Bibhutibhushan was posthumously awarded the Rabindra Prize (1951) for his novel Ichhamati. Bibhutibhushan previously was the assistant manager of his Bhagalpur estate.He later joined the Gopalnagar School where he continued to work until his death. The literary career of Bibhutibhushan started through the publication of his short story, 'Upeksita' in the prabasi of 1328 BS (1921). In 1925, while serving at Bhagalpur, he started writing pather panchali, finishing it in 1928. His other important writings include Aparajita (1931), Meghamallar (1931), Mauriphul (1932), Yatrabadal (1934), Chander Pahad (1937), Kinnardal (1938), Aranyak (1939), Adarsha Hindu Hotel (1940), Maraner Danka baje (1940), Smrtir Rekha (1941), Devayan (1944), Hiramanik Jwale (1946), Utkarna (1946), He Aranya Katha Kao (1948), Ichhamati (1950), Ashani Sangket (1959).  Pather Panchali, Bibhutibhushan’s first novel, is considered to be his masterpiece. Aparajita is a sequel to Pather Panchali. Both these novels draw considerably upon his personal life. Pather Panchali has been translated into several Indian and European languages and was made into a highly acclaimed film by satyajit ray, who also made two films based on Aparajita and Asani Sanket.", "knowmore": "https://en.wikipedia.org/wiki/Bibhutibhushan_Bandyopadhyay" } },
    { "model": "Blog.writer", "pk": 15, "fields": { "name": "Sukumar Ray", "penname": "Uhyanam Pandit", "image": "writer_pics/Sukumar_goCTM2R.jpg", "date_of_birth": "1887-10-30", "date_of_death": "1923-09-10", "Bio": "Sukumar Ray was a Bengali humorous poet, story writer and playwright. As perhaps the most famous Indian practitioner of literary nonsense, he is often compared to Lewis Carroll. His works such as the collection of poems \"Aboltabol\" \"HaJaBaRaLa\" , short story collection \"Pagla Dashu\" and play \"Chalachittachanchari\" are considered nonsense masterpieces equal in stature to Alice in Wonderland, and are regarded as some of the greatest treasures of Bangla literature. More than 80 years after his death, Ray remains one of the most popular of children's writers in Bengal.Sukumar Ray was the son of famous children's story writer Upendrakishore Ray (Ray Chowdhury) and the father of legendary Indian filmmaker Satyajit Ray. While Sukumar went to England to learn printing technology, Upendrakishore purchased land, constructed a building, and set up a printing press with facilities for high-quality halftone colour blockmaking and printing. He also launched the children's magazine, \"Sandesh\". Very soon after Sukumar's return from England, Upendrakishore died, and Sukumar ran the printing and publishing businesses and the Sandesh (magazine) for about eight years. His younger brother Subinoy helped him, and many relatives pitched in writing for \"Sandesh\".   Apart from the cultural and creative activities, Sukumar Ray was also a young man who was a leader of the reformist wing in the Brahmo Samaj.", "knowmore": "https://en.wikipedia.org/wiki/Sukumar_Ray" } },
    { "model": "Blog.writer", "pk": 16, "fields": { "name": "Devdutt Pattanaik", "penname": "None", "image": "writer_pics/DevduttPattanai_2JsD6uK.jpg", "date_of_birth": "1970-12-11", "date_of_death": null, "Bio": "Devdutt Pattanaik writes on relevance of mythology in modern times, especially in areas of management, governance and leadership.   Trained in medicine, he worked for 15 years in the healthcare and pharma industries before he focused on his passion full time. He is author of 41 books and over 1000 columns, with bestsellers such as My Gita, Jaya, Sita, Business Sutra and the 7 Secret Series.   He was a speaker at TEDIndia 2009 and spoke on Myths that Mystify, East versus West.   His TV shows include Business Sutra on CNBC-TV18 and Devlok on Epic TV. He consults organisations on culture, diversity and leadership and also consults various television channels and filmmakers on storytelling.", "knowmore": "https://en.wikipedia.org/wiki/Devdutt_Pattanaik" } },
    { "model": "Blog.writer", "pk": 17, "fields": { "name": "Neil Gaiman", "penname": "Scary Trousers", "image": "writer_pics/ng_FY96rkA.jpg", "date_of_birth": "1960-11-10", "date_of_death": null, "Bio": "Neil Gaiman is a bestselling, critically acclaimed writer who made his way in the comics/graphic novel world, becoming known for the groundbreaking series Sandman.Gaiman is active as a television and screenwriter. He wrote the screenplay for the original BBC TV series of ‘Neverwhere’ (1996); the feature film, ‘Mirrormask’ (2005), the script to Robert Zemeckis’s ‘Beowulf.’ He has written and directed two films: ‘A Short Film About John Bolton’ (2002) and ‘Statuesque’ (2009). An animated feature film based on his book ‘Coraline,’ directed by Henry Selick and released in early 2009, secured a BAFTA for Best Animated Film and was nominated for an Oscar in the same category. His 2011 episode of Doctor Who, “The Doctor’s Wife,” caused the London Times to describe him as “a hero.”  He is also an established writer for children. His work for young readers, The Graveyard Book was published in 2008 and won the UK’s Booktrust Prize for Teenage Fiction and the Newbery Medal, the highest honor given in US children’s literature, as well as the Locus Young Adult Award and the Hugo Best Novel Prize.  The awarding of the 2010 UK CILIP Carnegie Medal makes Gaiman the first author ever to win both the Newbery Medal and the Carnegie Medal with the same book.  Gaiman's 2013 novel The Ocean at the End of the Lane was voted Book of the Year in the British National Book Awards and was a New York Times Best Seller. A film adaptation of the novel is planned.   Neil Gaiman is married to the musician Amanda Palmer, they have a son, Anthony, together.", "knowmore": "https://en.wikipedia.org/wiki/Neil_Gaiman" } }
]